// from -40 to +125 with step 10

#include "ntc.h"

// number of additive ADC measures
#define TEMPERATURE_COUNT	64
// Значение температуры, возвращаемое если сумма результатов АЦП больше первого значения таблицы
#define TEMPERATURE_UNDER -400
// Значение температуры, возвращаемое если сумма результатов АЦП меньше последнего значения таблицы
#define TEMPERATURE_OVER 1250
// Значение температуры соответствующее первому значению таблицы
#define TEMPERATURE_TABLE_START -400
// Шаг таблицы
#define TEMPERATURE_TABLE_STEP 10

/* Таблица суммарного значения АЦП в зависимости от температуры. От большего значения к меньшему
   Для построения таблицы использованы следующие парамертры:
     R1(T1): 10кОм(25°С)
     B25/50: 3470
     Схема включения: A
     Ra: 10кОм
     Напряжения U0/Uref: 5В/5В
*/
TEMPERATURE_TABLE_DEFINITION = {
	63077, 62922, 62759, 62588, 62409, 62221, 62024, 61817,
	61602, 61376, 61140, 60895, 60638, 60371, 60093, 59804,
	59504, 59192, 58868, 58533, 58185, 57826, 57454, 57071,
	56675, 56266, 55846, 55413, 54968, 54511, 54042, 53561,
	53069, 52565, 52050, 51523, 50986, 50439, 49882, 49315,
	48738, 48153, 47559, 46957, 46348, 45731, 45108, 44479,
	43845, 43205, 42561, 41914, 41263, 40609, 39954, 39297,
	38639, 37981, 37323, 36666, 36010, 35356, 34704, 34055,
	33410, 32768, 32131, 31498, 30871, 30249, 29633, 29023,
	28420, 27823, 27234, 26652, 26079, 25512, 24954, 24405,
	23864, 23331, 22807, 22292, 21786, 21288, 20800, 20321,
	19851, 19390, 18938, 18495, 18061, 17636, 17220, 16813,
	16415, 16025, 15644, 15271, 14907, 14551, 14203, 13864,
	13532, 13208, 12892, 12583, 12282, 11988, 11701, 11421,
	11148, 10882, 10623, 10370, 10123, 9882, 9648, 9419,
	9196, 8979, 8768, 8561, 8360, 8164, 7974, 7788,
	7606, 7430, 7258, 7090, 6927, 6768, 6613, 6462,
	6314, 6171, 6031, 5895, 5762, 5633, 5507, 5384,
	5265, 5148, 5034, 4924, 4816, 4710, 4608, 4508,
	4410, 4315, 4223, 4132, 4044, 3959, 3875, 3793,
	3714, 3636, 3560, 3486, 3414, 3344
};

#ifndef STAVR_NO_INSOURCE
	#include "ntc.c"
#endif