// from -35 to +40 with step 0.5

#include "ntc.h"

// number of additive ADC measures
#define TEMPERATURE_COUNT	64
// Значение температуры, возвращаемое если сумма результатов АЦП больше первого значения таблицы
#define TEMPERATURE_UNDER -350
// Значение температуры, возвращаемое если сумма результатов АЦП меньше последнего значения таблицы
#define TEMPERATURE_OVER 400
// Значение температуры соответствующее первому значению таблицы
#define TEMPERATURE_TABLE_START -350
// Шаг таблицы
#define TEMPERATURE_TABLE_STEP 5

/* Таблица суммарного значения АЦП в зависимости от температуры. От большего значения к меньшему
   Для построения таблицы использованы следующие парамертры:
     R1(T1): 10кОм(25°С)
     B25/50: 3470
     Схема включения: A
     Ra: 10кОм
     Напряжения U0/Uref: 5В/5В
*/
TEMPERATURE_TABLE_DEFINITION = {
    62221, 62124, 62024, 61922, 61817, 61711, 61602, 61490,
    61376, 61260, 61140, 61019, 60895, 60768, 60638, 60506,
    60371, 60234, 60093, 59950, 59804, 59655, 59504, 59349,
    59192, 59031, 58868, 58702, 58533, 58361, 58185, 58007,
    57826, 57642, 57454, 57264, 57071, 56874, 56675, 56472,
    56266, 56058, 55846, 55631, 55413, 55192, 54968, 54741,
    54511, 54278, 54042, 53803, 53561, 53317, 53069, 52818,
    52565, 52309, 52050, 51788, 51523, 51256, 50986, 50714,
    50439, 50162, 49882, 49599, 49315, 49027, 48738, 48446,
    48153, 47857, 47559, 47259, 46957, 46653, 46348, 46040,
    45731, 45420, 45108, 44794, 44479, 44162, 43845, 43525,
    43205, 42884, 42561, 42238, 41914, 41589, 41263, 40937,
    40609, 40282, 39954, 39626, 39297, 38968, 38639, 38310,
    37981, 37652, 37323, 36994, 36666, 36337, 36010, 35682,
    35356, 35029, 34704, 34379, 34055, 33732, 33410, 33088,
    32768, 32449, 32131, 31814, 31498, 31184, 30871, 30559,
    30249, 29940, 29633, 29327, 29023, 28720, 28420, 28121,
    27823, 27528, 27234, 26942, 26652, 26365, 26079, 25794,
    25512, 25232, 24954, 24679, 24405, 24133, 23864
};

#ifndef STAVR_NO_INSOURCE
	#include "ntc.c"
#endif